USE LibreLibrary

INSERT INTO Book (isbn, author, introduction, name)
VALUES
  ('9789862355848', 'Walter Isaacson', '他的一生，讓世界活成了現在的樣貌。賈伯斯傳作者華特．艾薩克森另一經典巨作。美國之父班傑明．富蘭克林──迄今最完整、最權威傳記', '班傑明．富蘭克林：美國心靈的原型'),
  ('9789862017050', 'Robert C. Martin', '本書的原文書名為Clean Code: A Handbook of Agile Software Craftsmanship，根據作者的說法，無瑕的程式碼為Jolt得獎著作敏捷軟體開發：原則、樣式及實務的前傳。', '無瑕的程式碼：敏捷軟體開發技巧守則'),
  ('9786263350717', '劉潤', '事實是最不容易產生爭議的客觀存在嗎？或許，我們對事實的瞭解，還不夠全面。或許，我們是被表象或經驗欺騙、迷惑，導致看不透事情的本質。唯有透過「底層邏輯+環境變數」，才能讓你在千變萬化的世界中，認清所有真相！', '底層邏輯：看清這個世界的底牌'),
  ('9786263550537', 'Morgan Housel', '世界上有賺很多錢卻破產的人，也有賺很少錢卻有辦法捐大錢做慈善的人。為什麼？因為理財結果與運氣和風險有關，而且不受才智與個人努力影響，更重要的是，與其了解許多理財專業知識，適當的言行舉止更加關鍵。這就是致富心態，這是現今社會不可或缺的軟實力。', '致富心態：關於財富、貪婪與幸福的20堂理財課'),
  ('9789869820141', '金宇澄', '2018年台北國際書展書展大獎首獎得主金宇澄震撼文壇之作。胡晴舫、柯裕棻、張惠菁、馬家輝、傅月庵、黃麗群、黃崇凱、駱以軍推薦，王家衛即將改編電影，為繼《花樣年華》、《2046》後的第三部曲。', '繁花'),
  ('9789861339047', '井田千秋', '日本Amazon 800則五星好評推薦，上市後迅速熱銷10萬冊！溫暖、療癒、驚喜不斷，畫出那個或許也屬於你的，小小空間！構圖豐富有層次，房間格局布置考究，每一頁畫面都像百寶箱，承載了溫暖與幸福。', '戀家的人︰五個獨居女子的溫暖家居生活'),
  ('9789861755267', 'James Clear', '每天都進步1%，一年後，你會進步37倍；每天都退步1%，一年後，你會弱化到趨近於0！你的一點小改變、一個好習慣，將會產生複利效應，如滾雪球般，為你帶來豐碩的人生成果！一出版立刻風行全球，企業界、運動界、教育界、瘦身界都在用的習慣養成實作指南！', '原子習慣：細微改變帶來巨大成就的實證法則'),
  ('9789576587399', 'Robert de Board', '心理諮商創舉，取材自英國童話《柳林中的風聲》完美結合心理學的經典之作，授權10個語言版本，自1997年起長銷20多年。', '蛤蟆先生去看心理師'),
  ('9786263554573', 'Eric Yu', '此書並非勵志型的心靈雞湯書，而是具體可行的實踐手冊。在每一章的最後都有「行動清單」，指導讀者們一步一步從實作練習中累積經驗。在執行這些練習的過程中，實則已經踏上了自我實現的道路。', '內在成就：成為你真正想成為的人');
GO

SET IDENTITY_INSERT [dbo].[Inventory] ON;

INSERT INTO Inventory (inventoryId
           ,isbn
           ,status
           ,storeTime)
     VALUES
           (1,'9789862355848','在庫','2020-03-26'),
           (2,'9789862355848','出借中','2020-03-26'),
           (3,'9789862355848','整理中(歸還後未入庫)','2020-03-26'),
           (4,'9789862355848','遺失','2020-03-26'),
           (5,'9789862355848','損毀','2020-03-26'),
           (6,'9789862355848','廢棄','2020-03-26'),
           (7,'9789862017050','在庫','2021-05-18'),
           (8,'9789862017050','在庫','2021-05-18'),
           (9,'9789862017050','在庫','2021-05-18'),
           (10,'9789862017050','出借中','2021-05-18'),
           (11,'9789862017050','整理中(歸還後未入庫)','2021-05-18'),
           (12,'9786263350717','在庫','2020-01-19'),
           (13,'9786263350717','在庫','2020-01-19'),
           (14,'9786263350717','在庫','2020-01-19'),
           (15,'9786263350717','出借中','2020-01-19'),
           (16,'9786263350717','出借中','2020-01-19'),
           (17,'9789869820141','在庫','2020-05-07'),
           (18,'9789869820141','在庫','2020-05-07'),
           (19,'9789869820141','在庫','2020-05-07'),
           (20,'9789861339047','出借中','2020-05-08'),
           (21,'9789861339047','出借中','2020-05-08'),
           (22,'9789861339047','出借中','2020-05-08'),
           (23,'9789861339047','出借中','2020-05-08'),
           (24,'9789861755267','在庫','2020-02-05'),
           (25,'9789861755267','在庫','2020-02-05'),
           (26,'9789861755267','整理中(歸還後未入庫)','2020-02-05'),
           (27,'9789861755267','整理中(歸還後未入庫)','2020-02-05'),
           (28,'9789861755267','整理中(歸還後未入庫)','2020-02-05'),
           (29,'9789576587399','出借中','2021-06-02'),
           (30,'9789576587399','出借中','2021-06-02'),
           (31,'9789576587399','出借中','2021-06-02'),
           (32,'9789576587399','在庫','2021-06-02'),
           (33,'9789576587399','在庫','2021-06-02'),
           (34,'9789576587399','整理中(歸還後未入庫)','2021-06-02'),
           (35,'9786263554573','在庫','2021-06-19'),
           (36,'9786263554573','在庫','2021-06-19'),
           (37,'9786263554573','在庫','2021-06-19'),
           (38,'9786263554573','在庫','2021-06-19'),
           (39,'9786263550537','在庫','2021-08-09'),
           (40,'9786263550537','在庫','2021-08-09'),
           (41,'9786263550537','在庫','2021-08-09'),
           (42,'9786263550537','遺失','2021-08-09'),
           (43,'9786263550537','出借中','2021-08-09');

SET IDENTITY_INSERT [dbo].[Inventory] OFF;
GO

